[
    {
        "title": "US Strategic Command: Nuclear Triad on \"Constant Readiness\"",
        "source": "Defense News",
        "date": "2026-02-25",
        "region": "United States / Global",
        "actors": [
            "US Strategic Command",
            "Pentagon"
        ],
        "event_type": "Military",
        "description": "US Strategic Command confirmed that all three legs of the nuclear triad are at a state of constant readiness. This posture is cited as a response to \\\"emerging multi-front threats\\\" in the Middle East.",
        "text": "OFFICIAL STATEMENT (Feb 25, 2026) - US Strategic Command has issued a rare public confirmation that the nations nuclear triad—land-based missiles, submarine-launched missiles, and strategic bombers—has moved to a state of constant readiness. While officials did not name Iran specifically in the headline, the briefing focused on the \\\"unprecedented synchronization\\\" of naval assets in the Persian Gulf. \\\"Our goal is peace, but our capability is absolute deterrence,\\\" a senior defense official stated."
    },
    {
        "title": "IRGC Announces \"Great Prophet 21\" Naval Drills",
        "source": "Tasnim News Agency",
        "date": "2026-02-24",
        "region": "Persian Gulf / Strait of Hormuz",
        "actors": [
            "IRGC Navy",
            "Iranian Defense Ministry"
        ],
        "event_type": "Drill",
        "description": "The IRGC has commenced a large-scale naval exercise involving hundreds of fast-attack craft and anti-ship missile batteries. The drill simulates the closure of the Strait of Hormuz.",
        "text": "MILITARY UPDATE (Feb 24, 2026) - The Islamic Revolutionary Guard Corps (IRGC) has officially launched the \\\"Great Prophet 21\\\" military exercises in the Persian Gulf and the Sea of Oman. The drills involve the deployment of new long-range drones and precision-guided anti-ship missiles. Rear Admiral Alireza Tangsiri stated that the exercise is a message to \\\"extra-regional forces\\\" that Iran is the sole guarantor of maritime security in these waters."
    },
    {
        "title": "Israel Finalizes Multi-Layer Defense Shield Activation",
        "source": "Jerusalem Post",
        "date": "2026-02-25",
        "region": "Israel",
        "actors": [
            "IDF",
            "Israeli Ministry of Defense"
        ],
        "event_type": "Military",
        "description": "Israel has activated its full multi-layer defense system (Iron Dome, David's Sling, Arrow-3) across the entire country. The move follows intelligence reports of high-alert status among regional proxies.",
        "text": "SECURITY ALERT (Feb 25, 2026) - The IDF has completed the full activation of the nations multi-tier air defense network. This is the first time since the 2023 conflict that the system has been fully operational on all fronts simultaneously. Residents in the north and south have been advised to remain near shelters, though no specific evacuation order has been issued. Defense officials describe the move as \\\"precautionary but necessary\\\" given the rhetoric from Tehran."
    },
    {
        "title": "Oman Issues Emergency Mediation Proposal to Geneva Delegates",
        "source": "Al Arabiya",
        "date": "2026-02-25",
        "region": "Oman / Switzerland",
        "actors": [
            "Omani Foreign Ministry",
            "US-Iran Negotiators"
        ],
        "event_type": "Diplomatic",
        "description": "Omani mediators have submitted an emergency proposal to bridge the gap between US and Iranian negotiators in Geneva. The proposal focuses on a 30-day \"freeze-for-freeze\" protocol.",
        "text": "DIPLOMATIC UPDATE (Feb 25, 2026) - Omani officials have delivered a last-minute mediation framework to the head delegates in Geneva. The proposal, dubbed the \\\"Muscat Protocol,\\\" calls for a 30-day freeze on U.S. naval reinforcements in exchange for a temporary halt to Iran's 60% enrichment activities. While both sides have acknowledged receipt of the document, no formal acceptance has been announced as the military buildup continues."
    },
    {
        "title": "US State Department Issues \"Level 4: Do Not Travel\" for Entire Region",
        "source": "State Department Official Website",
        "date": "2026-02-24",
        "region": "Middle East",
        "actors": [
            "US State Department"
        ],
        "event_type": "Security Alert",
        "description": "The US State Department has raised travel advisories to the highest level for several countries in the Middle East. Security posture at regional embassies has also been increased.",
        "text": "OFFICIAL ADVISORY (Feb 24, 2026) - The U.S. Department of State has updated its travel advisories for Iraq, Lebanon, and the Gulf states to Level 4: Do Not Travel. The advisory cites the \\\"unpredictable security environment and potential for rapid escalation.\\\" Non-essential embassy staff in certain capitals have been authorized to depart voluntarily. This move signals a significant shift in Washingtons assessment of the immediate threat landscape."
    },
    {
        "title": "US Orders Partial Evacuation of Embassy in Baghdad",
        "source": "Reuters",
        "date": "2026-02-23",
        "region": "Iraq",
        "actors": [
            "US State Department",
            "US Embassy Baghdad"
        ],
        "event_type": "Security Alert",
        "description": "The United States has ordered the departure of non-emergency government employees and their family members from its embassy in Baghdad due to increased security threats.",
        "text": "WASHINGTON/BAGHDAD (Feb 23) - Reuters has confirmed that the U.S. State Department has formally ordered a partial evacuation of its diplomatic mission in Iraq. This level of security alert follows a surge in rocket and drone threats from local militias linked to the regional US-Iran standoff. \\\"We prioritize the safety of our personnel above all else during these volatile times,\\\" a State Department spokesperson said."
    },
    {
        "title": "US Mission in Lebanon Authorized for Voluntary Departure",
        "source": "AP News",
        "date": "2026-02-24",
        "region": "Lebanon",
        "actors": [
            "US Embassy Beirut",
            "Hezbollah"
        ],
        "event_type": "Security Alert",
        "description": "US Embassy in Beirut has authorized the voluntary departure of non-essential staff and family members as border tensions with Israel reach a critical point.",
        "text": "BEIRUT (Feb 24) - AP News reports that the U.S. Embassy in Beirut has moved to its highest level of internal security alert. While not a mandatory evacuation, family members of diplomats have been authorized to leave Lebanon. The advisory cited the potential for a sudden closure of commercial airspace and the unpredictable nature of the ongoing conflict between Hezbollah and the IDF."
    },
    {
        "title": "UK Foreign Office Withdraws Staff from Gulf Embassies",
        "source": "The Guardian",
        "date": "2026-02-25",
        "region": "Gulf States / UK",
        "actors": [
            "UK Foreign Office",
            "British Embassies"
        ],
        "event_type": "Security Alert",
        "description": "Following US moves, the UK has begun withdrawing non-essential staff from embassies in Qatar, UAE, and Bahrain as a precautionary measure.",
        "text": "LONDON (Feb 25) - In a coordinated move with Washington, the UK Foreign Office has announced a temporary reduction in diplomatic staffing levels across the Persian Gulf. Officials stated that the move is purely precautionary but reflects the heightened risk of regional spillover from the US-Iran nuclear standoff. UK citizens in the region are advised to maintain a high state of vigilance."
    },
    {
        "title": "Guterres: Persian Gulf is at a \"Breaking Point,\" Urges Maximum Restraint",
        "source": "UN News",
        "date": "2026-02-25",
        "region": "Global / Middle East",
        "actors": [
            "Antonio Guterres",
            "United Nations"
        ],
        "event_type": "Diplomatic",
        "description": "UN Secretary-General Antonio Guterres has issued an emergency appeal to both Washington and Tehran, stating the region is at a breaking point and one miscalculation could lead to global catastrophe.",
        "text": "UNITED NATIONS (Feb 25, 2026) - Secretary-General Antonio Guterres addressed the General Assembly today with a somber warning. \\\"The Persian Gulf is at a breaking point not seen in decades. The machinery of war is being greased while the machinery of diplomacy is grinding to a halt,\\\" he said. Guterres called for an immediate 48-hour \\\"strategic pause\\\" in naval movements to allow mediators to finalize the Geneva framework. He specifically criticized the \\\"escalatory rhetoric and unilateral actions\\\" that have undermined international law."
    },
    {
        "title": "Germany and France Criticize US \"Lack of Diplomatic Flexibility\"",
        "source": "Deutsche Welle",
        "date": "2026-02-24",
        "region": "Europe / United States",
        "actors": [
            "German Foreign Ministry",
            "French Foreign Ministry"
        ],
        "event_type": "Diplomatic",
        "description": "In a joint statement, Berlin and Paris expressed frustration with the US refusal to accept the latest Omani-led compromise in Geneva, warning that military pressure alone will not work.",
        "text": "BERLIN/PARIS (Feb 24, 2026) - The European core of the E3 has broken ranks with Washingtons latest strategy. A joint statement from the German and French foreign ministries criticized the U.S. administrations \\\"lack of diplomatic flexibility\\\" in the latest round of Geneva talks. \\\"We believe the Omani proposal offered a viable path to de-escalation. Doubling down on the naval armada without a clear diplomatic off-ramp is a dangerous gamble that endangers European security and global energy markets,\\\" the statement read."
    },
    {
        "title": "Russian Transport Planes Spotted in Tehran; Reports of Advanced S-500 Transit",
        "source": "Intelligence Online",
        "date": "2026-02-25",
        "region": "Iran / Russia",
        "actors": [
            "Russian Air Force",
            "Iranian Air Defense"
        ],
        "event_type": "Military",
        "description": "Open-source intelligence reports multiple Russian heavy transport aircraft landing in Tehran. Experts suggest the delivery of S-500 air defense components following the strategic pact signing.",
        "text": "TEHRAN (Feb 25, 2026) - Satellite imagery and flight tracking data show a surge in Russian Il-76 and An-124 transport flights into Mehrabad International Airport over the last 48 hours. Military analysts believe these flights are delivering the first components of the S-500 Prometheus air defense system to Iran, a move intended to counter the U.S. naval air wing presence. This delivery follows the signing of the trilateral strategic pact between Moscow, Beijing, and Tehran in late January."
    },
    {
        "title": "China-Iran Naval Drills to Include \"Advanced Electronic Warfare\" Testing",
        "source": "Xinhua",
        "date": "2026-02-24",
        "region": "Gulf of Oman",
        "actors": [
            "PLA Navy",
            "IRGC Navy"
        ],
        "event_type": "Drill",
        "description": "Beijing has confirmed that its participating vessels in the \"Great Prophet 21\" drills will test advanced electronic jamming systems intended to disrupt carrier-based communications.",
        "text": "BEIJING (Feb 24, 2026) - Xinhua has reported that the Peoples Liberation Army (PLA) Navy will take a leading role in the electronic warfare phase of the ongoing drills in the Gulf of Oman. The exercises will focus on \\\"denial of access\\\" and disrupting carrier-strike-group command and control systems. This is the first time China has deployed its most advanced ship-borne jamming suites to a potential conflict zone in the Middle East."
    },
    {
        "title": "Iraqi Prime Minister: Iraq Will Not Be a Proxy Battlefield for US or Iran",
        "source": "Al Monitor",
        "date": "2026-02-25",
        "region": "Iraq",
        "actors": [
            "Mohammed Shia al-Sudani",
            "Iraqi Government"
        ],
        "event_type": "Political Statement",
        "description": "Prime Minister al-Sudani has rejected US requests for increased logistical access to Iraqi bases, citing the need to maintain Iraqi sovereignty and neutrality.",
        "text": "BAGHDAD (Feb 25, 2026) - Prime Minister Mohammed Shia al-Sudani has issued a firm refusal to Washingtons request for expanded use of the Al-Asad Airbase for offensive contingencies. \\\"Iraq is a sovereign nation, not an auxiliary airfield for external conflicts. We will not allow our land, sky, or water to be used to attack any of our neighbors, nor will we allow our soil to be a target for retaliation,\\\" Sudani stated during a national security council meeting."
    }
]